<a href="https://colab.research.google.com/github/YHdoc/C-and-Python/blob/main/%E2%80%8D%EC%98%A4%EC%98%81%ED%9B%88%5B%EC%9E%AC%ED%95%99_%EC%82%AC%ED%95%99%EA%B3%BC%5D_ch6_homework_2021_student.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Homework - SQL2

1. Use Google Colabortory and do your homework.
3. (In Google colaboratory) Before you submit your homework, restart kernel and run every cell!
4. Save (File->Save) the file
5. Submit your homework (this file) in Google classroom
6. **Don't forget to click "제출" button** ("Submit", "완료로 표시", 또는 "제출" 버턴을 누르지 않으면 제출된 것이 아님)
7. No late homeworks will be accepted for any reason!

To edit this cell, double click here
```
이름:___________오영훈____________
학번:_________201601994___________
학과:___________사학과____________
제출일:______________________
```

- 권고사항: 모든 SQL select 문에 tuple variable를 사용할 것.

- SQL 작성시, 문제에 주어지지 않은 상수를 사용하는 경우 (cheating), **마이너스 점수**를 받는다.

- **점수: 각 10점, 18번 20점, 총200점**

In [1]:
%load_ext sql

In [2]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 767 kB/s
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

### Use your host, id, password, and database

In [3]:
import getpass
user = 's201601994'
password = getpass.getpass()
host='dm.hufs.ac.kr' # 수정
database = 's201601994db'
connection_string = f'mysql+pymysql://{user}:{password}@{host}:3306/{database}'
    
%sql $connection_string

··········

'Connected: s201601994@s201601994db'

## Warning: Your companydb state MUST be clean as initial state

- Refer to jupyter notebook on "SQL Lab"

### When you list the name of employees, the name must be the following format:

- Output Schema and tuple format:

```
+------------------+
| Employee name    |
+------------------+
| John B. Smith    |
...
+------------------+
```

- Use MySQL concat 함수 사용, Refer to MySQL manual or  Googling

### 1-13번에 대해 SQL select 문을 작성하고 MySQL에서 실행한 결과물을 제출하시오.

#### 1. Retrieve the names of employees in department 5 who work more than 10 hours per week on the 'ProductX' project. (single SELECT 사용, MySQL concat 함수 사용)

In [17]:
# %%sql
# -- YOUR CODE HERE
# SELECT CONCAT(E.Fname,' ',E.Minit,'.',' ', E.Lname) AS "Employee name"
# FROM EMPLOYEE E
# WHERE E.Dno = 5 and E.SSN in(
#   SELECT WO.ESSN
#   FROM WORKS_ON WO, PROJECT P
#   WHERE WO.Hours > 10 and P.Pname = 'ProductX' and WO.Pno = P.Pnumber
# )


%%sql
-- YOUR CODE HERE
SELECT CONCAT(E.Fname,' ',E.Minit,'.',' ', E.Lname) AS "Employee name"
FROM EMPLOYEE E, WORKS_ON WO, PROJECT P
WHERE E.Dno = 5 and E.SSN = WO.ESSN and WO.Hours > 10 and P.Pname = 'ProductX' and WO.Pno = P.Pnumber

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
2 rows affected.

[('John B. Smith',), ('Joyce A. English',)]


#### 2.  List the names of employees who have a dependent with the same sex as themselves. (EXISTS 사용)

In [18]:
%%sql
-- YOUR CODE HERE
SELECT CONCAT(E.Fname,' ',E.Minit,'.',' ', E.Lname) AS "Employee name"
FROM EMPLOYEE E
WHERE EXISTS (
  SELECT *
  FROM DEPENDENT D
  WHERE E.SSN = D.ESSN and E.Sex = D.Sex
)

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
2 rows affected.

[('John B. Smith',), ('Franklin T. Wong',)]

#### 3.  Find the names of employees that are directly supervised by 'Franklin Wong'. (EXISTS 사용)

In [19]:
%%sql
-- YOUR CODE HERE
# SELECT CONCAT (E.Fname, ' ', E.Minit, '.', ' ', E.Lname) AS "Employee name"
# FROM EMPLOYEE E
# WHERE EXISTS 
# (
#   SELECT *
#   FROM EMPLOYEE E1, DEPARTMENT D
#   WHERE D.Mgrssn = E.Superssn and E.Ssn = E1.Superssn and E.Fname = "Franklin" and E.Lname = "Wong"
# )


SELECT CONCAT (E.Fname, ' ', E.Minit, '.', ' ', E.Lname) AS "Employee name"
FROM EMPLOYEE E
WHERE exists 
(    #e가 Franklin Wong의 부하직원이라는 사실이 있는 것
    SELECT * 
    FROM EMPLOYEE EM
    WHERE E.superssn = EM.ssn and EM.lname = 'Wong' and EM.fname = 'Franklin'
)

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
3 rows affected.

[('John B. Smith',), ('Joyce A. English',), ('Ramesh K. Narayan',)]

#### 4.  For each project, list the project name and the total hours per week (by all employees) spent on that project.
Output Schema:
```
+-----------------+-------------+
| Project name    | Total hours |
+-----------------+-------------+
```

In [20]:
%%sql
-- YOUR CODE HERE
SELECT CONCAT(Pname) AS "Project name", CONCAT(TRUNCATE(SUM(WO.Hours),1)) AS "Total Hours"
FROM PROJECT P, WORKS_ON WO
WHERE WO.Pno = P.Pnumber
GROUP BY P.Pname

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
6 rows affected.

[('Computerization', '55.0'),
 ('Newbenefits', '55.0'),
 ('ProductX', '52.5'),
 ('ProductY', '37.5'),
 ('ProductZ', '50.0'),
 ('Reorganization', '25.0')]

#### 5.  Retrieve the names of employees who work on every project managed by 'Administration' department.

In [21]:
%%sql
-- YOUR CODE HERE
SELECT CONCAT (E.Fname, ' ', E.Minit, '.', ' ', E.Lname) AS "Employee name"
FROM EMPLOYEE E
WHERE EXISTS
(
  SELECT *
  FROM PROJECT P, WORKS_ON WO, DEPARTMENT D
  WHERE E.Ssn = WO.Essn and P.Pnumber = WO.Pno and D.Dnumber = P.Dnum and D.Dname = "Administration"
)

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
4 rows affected.

[('Franklin T. Wong',),
 ('Jennifer S. Wallace',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 6.  Retrieve the names of employees who do not work on any project which is located in 'Houston'. (NOT EXISTS 사용)

In [22]:
%%sql
-- YOUR CODE HERE
SELECT CONCAT (E.Fname, ' ', E.Minit, '.', ' ', E.Lname) AS "Employee name"
FROM EMPLOYEE E
WHERE NOT EXISTS
(
  SELECT *
  FROM PROJECT P, WORKS_ON WO
  WHERE P.Pnumber = WO.Pno and WO.Essn = E.ssn and P.Plocation = 'Houston'
)

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
4 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 7.  For each department, retrieve the department name, and the average salary of employees working in that department.(소수점 이하 2자리까지만(버림) 출력, Refer to MySQL manual or  Googling)

Output schema
```
+-----------------+----------------+
| Department name | Average salary |
+-----------------+----------------+
```

In [23]:
%%sql
-- YOUR CODE HERE
# truncate인가 함수 사용하면 됨. 함수 찾아보도록.

# SELECT CONCAT (D.Dname) AS "Department name" #, CONCAT (E.salary) AS "Average salary"
# FROM DEPARTMENT D, EMPLOYEE E 
# WHERE E.Dno = D.Dnumber
# GROUP BY D.Dname #, E.Salary


# SELECT CONCAT (E.salary) AS "Average salary"    
# FROM DEPARTMENT D, EMPLOYEE E 
# WHERE E.Dno = D.Dnumber
# GROUP BY E.Salary                                 



SELECT CONCAT (D.Dname) AS "Department name", CONCAT(TRUNCATE(AVG(E.salary),2)) AS "Average salary"
FROM DEPARTMENT D, EMPLOYEE E 
WHERE E.Dno = D.Dnumber
GROUP BY D.Dname

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
3 rows affected.

[('Administration', '31000.00'),
 ('Headquarters', '55000.00'),
 ('Research', '33250.00')]

#### 8.  Retrieve the average salary of all female employees. (소수점 이하 2자리까지만(버림) 출력, Refer to MySQL manual or  Googling)
Output Schema:
```
+----------------+
| Average salary |
+----------------+
```

In [24]:
%%sql
-- YOUR CODE HERE
SELECT CONCAT(TRUNCATE(AVG(E.Salary),2)) AS "Average Salary"
FROM EMPLOYEE E
WHERE E.Sex = 'F'

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
1 rows affected.

[('31000.00',)]

#### 9.  Find the names and addresses of employees who work on at least one project located in Houston but whose department has no location in Houston. (EXISTS, NOT EXISTS 사용)

Output schema:

```
+---------------------+-------------------------+
| Employee name       | Address                 |
+---------------------+-------------------------+
```

In [25]:
%%sql
-- YOUR CODE HERE
SELECT CONCAT(E1.Fname,' ',E1.Minit,'.',E1.Lname) AS "Employee name", CONCAT(E1.Address) AS "Address"
FROM EMPLOYEE E1
WHERE 
EXISTS
(
  SELECT * 
  FROM WORKS_ON WO1, PROJECT P1
  WHERE WO1.Pno = P1.Pnumber and P1.Plocation = "Houston" and E1.Ssn = WO1.Essn 
)
and
NOT EXISTS
(
  SELECT * 
  FROM DEPARTMENT D1, DEPT_LOCATIONS DL1
  WHERE D1.Dnumber = DL1.Dnumber and DL1.Dlocation = "Houston" and E1.Dno = D1.Dnumber
)

  # SELECT * 
  # FROM EMPLOYEE E1, DEPARTMENT D1, DEPT_LOCATIONS DL1
  # WHERE D1.Dnumber = DL1.Dnumber and DL1.Dlocation = "Houston" and E1.Dno = D1.Dnumber

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
1 rows affected.

[('Jennifer S.Wallace', '291-Berry-Bellaire-TX')]


#### 10.  List the names of department managers who have no dependents. (EXISTS, NOT EXISTS 사용)

In [26]:
%%sql
-- YOUR CODE HERE
SELECT CONCAT (E.Fname,' ',E.Minit,'.',' ',E.Lname) AS "Department managers"
FROM EMPLOYEE E
WHERE
EXISTS
(
  SELECT *
  FROM DEPARTMENT D
  WHERE D.MGRSSN = E.SSN 
)
AND
NOT EXISTS
(
  SELECT *
  FROM DEPARTMENT D, DEPENDENT DPDT
  WHERE D.MGRSSN = E.SSN AND E.SSN = DPDT.ESSN 
)

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
1 rows affected.

[('James E. Borg',)]

#### 11. Retrieve the names of all employees who work in the department that has the employee with the highest salary among all employees.

In [27]:
%%sql
-- YOUR CODE HERE
SELECT CONCAT (E1.Fname,' ',Minit,'.',' ',E1.Lname ) AS "Employee names"
FROM EMPLOYEE E1
WHERE
EXISTS
(
  SELECT *
  FROM EMPLOYEE E2
  WHERE E1.Dno=E2.Dno and E1.Salary >= ALL(SELECT E2.Salary FROM EMPLOYEE E2) 
)

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
1 rows affected.

[('James E. Borg',)]

#### 12-1. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (EXISTS 안에 EXISTS 사용)

In [28]:
%%sql
-- YOUR CODE HERE
SELECT CONCAT (E1.Fname,' ',E1.Minit,'.',' ',E1.Lname ) AS "Employee names"
FROM EMPLOYEE E1
WHERE
EXISTS
(
  SELECT *
  FROM EMPLOYEE E2
  WHERE E1.Superssn = E2.ssn and
  Exists
  (
    SELECT *
    FROM EMPLOYEE E3
    WHERE E2.Superssn = E3.Ssn and E3.Fname = "James" and E3.Lname = "Borg" 
  )
)

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
5 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 12-2. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (single SELECT 사용)

In [29]:
%%sql
-- YOUR CODE HERE

SELECT CONCAT (E1.Fname,' ',E1.Minit,'.',' ',E1.Lname ) AS "Employee names"
FROM EMPLOYEE E1, EMPLOYEE E2, EMPLOYEE E3
WHERE E1.Superssn = E2.ssn and E2.Superssn = E3.Ssn and E3.Fname = "James" and E3.Lname = "Borg" 
# EXISTS
# (
#   SELECT *
#   FROM EMPLOYEE E2
#   WHERE E1.Superssn = E2.ssn and
#   Exists
#   (
#     SELECT *
#     FROM EMPLOYEE E3
#     WHERE E2.Superssn = E3.Ssn and E3.Fname = "James" and E3.Lname = "Borg" 
#   )
# )

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
5 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 13. Retrieve the names of employees who make at least 10,000 dollars more than the employee who is paid the least in the company.

In [30]:
%%sql
-- YOUR CODE HERE
SELECT CONCAT (E1.Fname,' ',E1.Minit,'.',' ',E1.Lname ) AS "Employee names"
FROM EMPLOYEE E1
WHERE E1.Salary >=  (SELECT MIN(E2.Salary)+10000 FROM EMPLOYEE E2)



# SELECT MIN(E2.Salary)
# FROM EMPLOYEE E2

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
4 rows affected.

[('Franklin T. Wong',),
 ('Ramesh K. Narayan',),
 ('James E. Borg',),
 ('Jennifer S. Wallace',)]

### 14-17번에 대해 SQL view문을 작성하고 MySQL에서 “select * from <view_name>”을 실행한 결과물을 제출하시오.

#### 14. A view that has the department name, manager name, and manager salary for every department

In [31]:
%%sql

DROP VIEW if exists DEPT_VIEW

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.

[]

In [32]:
%%sql
-- YOUR CODE HERE

CREATE VIEW DEPT_VIEW
AS
SELECT CONCAT(D1.DNAME) AS "DEPARTMENT NAME", CONCAT(E1.FNAME,' ', E1.LNAME) AS "MANAGER NAME", CONCAT(E1.SALARY) AS "MANAGER SALARY"
# SELECT D1.DNAME, E1.FNAME, E1.LNAME, E1.SALARY
FROM DEPARTMENT D1, EMPLOYEE E1
WHERE D1.Mgrssn = E1.Ssn #and E1.Dno = D1.Dnumber  #"매니저가 이미 각 부서별로 한명씩 있는 것이기에 이 부분은 해도 되고 안 해도 결과는 똑같다."라고 이해했다.(다시 볼것)

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.

[]

In [33]:
%sql select * from DEPT_VIEW;

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
3 rows affected.

[('Headquarters', 'James Borg', '55000.00'),
 ('Administration', 'Jennifer Wallace', '43000.00'),
 ('Research', 'Franklin Wong', '40000.00')]

#### 15. A view that has the employee name, supervisor name, and employee salary for each employee who works in the ‘Research’ department

In [14]:
%%sql

DROP VIEW if exists RESEARCH_DEPT_VIEW

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.

[]

In [15]:
%%sql
-- YOUR CODE HERE
CREATE VIEW RESEARCH_DEPT_VIEW
AS
SELECT CONCAT(E1.FNAME,' ', E1.LNAME) AS "EMPLOYEE NAME", CONCAT (E2.FNAME,' ',E2.LNAME) AS "SUPERVISOR NAME" , CONCAT (E1.SALARY) AS 'EMPLOYEE SALARY'
FROM EMPLOYEE E1, EMPLOYEE E2, DEPARTMENT D1
WHERE D1.DNAME = "Research" AND E2.SSN = E1.SUPERSSN AND E1.DNO = D1.DNUMBER

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.

[]

In [16]:
%sql select * from RESEARCH_DEPT_VIEW;

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
4 rows affected.

[('John Smith', 'Franklin Wong', '30000.00'),
 ('Franklin Wong', 'James Borg', '40000.00'),
 ('Joyce English', 'Franklin Wong', '25000.00'),
 ('Ramesh Narayan', 'Franklin Wong', '38000.00')]

#### 16. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project

In [11]:
%%sql

DROP VIEW if exists PROJECT_VIEW

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.

[]

In [12]:
%%sql
-- YOUR CODE HERE
CREATE VIEW PROJECT_VIEW
AS
SELECT CONCAT(P1.PNAME) AS "PROJECT NAME", CONCAT (D1.DNAME) AS "CONTROLLING DEPARTMENT NAME", CONCAT (COUNT(E1.SSN)) AS "NUMBER OF EMPLOYEES", CONCAT(TRUNCATE(SUM(WO1.HOURS),1)) AS 'TOTAL HOURS WORKED PER WEEK' 
FROM EMPLOYEE E1, PROJECT P1, DEPARTMENT D1, WORKS_ON WO1
WHERE P1.DNUM = D1.DNUMBER AND P1.PNUMBER = WO1.PNO AND E1.SSN = WO1.ESSN #AND E1.DNO = D1.DNUMBER => 이걸 넣으면 해당 부서 소속이 아니면서도 해당부서가 담당하는 프로젝트에 참여하는 사람들은 고려되지 않는다. 그러므로 넣으면 안 됨. P의 DNO도 마찬가지
GROUP BY P1.PNAME
#결과로 나타나는 NUMBER OF EMPLOYEES의 수는, 각 부서의 인원수가 아니라 각 부서가 담당하는 프로젝트에 참여하는 인원의 수이다. (질의의 마지막에 'for each project'에 근거)

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.

[]

In [13]:
%sql select * from PROJECT_VIEW;

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
6 rows affected.

[('ProductX', 'Research', '2', '52.5'),
 ('ProductY', 'Research', '3', '37.5'),
 ('ProductZ', 'Research', '2', '50.0'),
 ('Computerization', 'Administration', '3', '55.0'),
 ('Reorganization', 'Headquarters', '3', '25.0'),
 ('Newbenefits', 'Administration', '3', '55.0')]

#### 17. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project with more than two employees working on it

In [7]:
%%sql

DROP VIEW if exists PROJECT_VIEW_GT2

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.

[]

In [8]:
%%sql
-- YOUR CODE HERE

CREATE VIEW PROJECT_VIEW_GT2
AS
SELECT CONCAT(P1.PNAME) AS "PROJECT NAME", CONCAT (D1.DNAME) AS "CONTROLLING DEPARTMENT NAME", CONCAT (COUNT(E1.SSN)) AS "NUMBER OF EMPLOYEES", CONCAT(TRUNCATE(SUM(WO1.HOURS),1)) AS 'TOTAL HOURS WORKED PER WEEK' 
FROM EMPLOYEE E1, PROJECT P1, DEPARTMENT D1, WORKS_ON WO1
WHERE P1.DNUM = D1.DNUMBER AND P1.PNUMBER = WO1.PNO AND E1.SSN = WO1.ESSN
GROUP BY P1.PNAME
HAVING COUNT(E1.SSN) > 2  
# WHERE 절에서는 집계함수를 사용 할 수 없다.
# HAVING 절은 집계함수를 가지고 조건비교를 할 때 사용한다.
# HAVING절은 GROUP BY절과 함께 사용이 된다.

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.

[]

In [9]:
%sql select * from PROJECT_VIEW_GT2;

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
4 rows affected.

[('ProductY', 'Research', '3', '37.5'),
 ('Computerization', 'Administration', '3', '55.0'),
 ('Reorganization', 'Headquarters', '3', '25.0'),
 ('Newbenefits', 'Administration', '3', '55.0')]

#### 18. EMPLOYEE 테이블의 salary의 변경사항이 있을 때 마다, 변경사항을 기록하는 테이블 salary_audit(ssn, before_salary, after_salary, u_datetime)을 만들고, update trigger를 사용하여 변경사항을 기록하시오. 5번 부서에 속하는 직원의 salary를 100% 상향 조정 후, “select * from salary_audit”를 통해 결과를 확인하시오. udatetime에는 수정이 실행된 DATETIME(SQL Datatype, 날짜와 시각)을 기록한다. 현재 시각값은 now() 함수를 통해 얻을 수 있다.

## Warning
- 18번 문제 Update 한 후에 1-17번 문제를 다시 풀면 다른 결과가 나올 수 있음
- 1-17번 문제는 반드시 companydb의 초기 상태에서 풀어야 함

In [48]:
%%sql
DROP TABLE if exists salary_audit

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.

[]

In [50]:
%%sql
-- YOUR CODE HERE for "create table ..."
# 18번 문제를 풀면 DB상태가 다 바뀐다. 그래서 이거 풀고 위에 문제를 다시 풀 수는 없음. 그러려면 %%sql을 다시 실행해주어야 한다.


CREATE TABLE salary_audit
(
  Ssn             CHAR(9) NOT NULL,
  before_salary   DECIMAL(10, 2),
  after_salary    DECIMAL(10, 2),
  u_datetime      DATETIME
  # PRIMARY KEY (Ssn)                     #오류발생
  # FOREIGN KEY (Ssn)                
  #         REFERENCES EMPLOYEE(Ssn) 
  #         ON UPDATE CASCADE
)

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.

[]

In [49]:
%%sql

DROP TRIGGER if exists Salary_audit_trigger

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.

[]

In [51]:
%%sql
-- YOUR CODE HERE for "create trigger ..."


CREATE TRIGGER Salary_audit_trigger
AFTER UPDATE ON EMPLOYEE
FOR EACH ROW
BEGIN
  IF NEW.Salary != OLD.Salary 
  THEN INSERT INTO salary_audit VALUES ( NEW.Ssn, OLD.Salary, NEW.Salary, now());
  END IF;
END

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.

[]

In [52]:
%%sql

SELECT *
FROM EMPLOYEE

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [53]:
%sql select * from salary_audit_trigger;

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
0 rows affected.

[]

In [54]:
%sql update EMPLOYEE set salary = 2 * salary where dno = 5;

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
4 rows affected.

[]

In [55]:
%sql select * from salary_audit;

 * mysql+pymysql://s201601994:***@dm.hufs.ac.kr:3306/s201601994db
4 rows affected.

[('123456789', Decimal('30000.00'), Decimal('60000.00'), datetime.datetime(2021, 12, 3, 23, 55, 42)),
 ('333445555', Decimal('40000.00'), Decimal('80000.00'), datetime.datetime(2021, 12, 3, 23, 55, 42)),
 ('453453453', Decimal('25000.00'), Decimal('50000.00'), datetime.datetime(2021, 12, 3, 23, 55, 42)),
 ('666884444', Decimal('38000.00'), Decimal('76000.00'), datetime.datetime(2021, 12, 3, 23, 55, 42))]